Revit 2027 API
ParameterTypeId.RbsElecCircuitState Property
 "Circuit State"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecCircuitState { get; }
Public Shared ReadOnly Property RbsElecCircuitState As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecCircuitState {
	ForgeTypeId^ get ();
}
static member RbsElecCircuitState : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace